#+Title: 
#+Author: Mark Armstrong
#+Description: 

*** The code

First, a function which calculates the fuel required for a given mass.
Later (in part 2) this calculation becomes more realistic,
hence we name this block ~naive-fuel-required~.
For now, we only need divide the mass by three, rounding down
(which is the default behaviour for integer division, but we truncate
the result in case one of the masses happens to be non-integer)
and then subtract 2.
#+name: naive-fuel-required
#+begin_src emacs-lisp
(defun fuel-required (mass)
  (let ((⌊mass/3⌋ (truncate (/ mass 3))))
    (- ⌊mass/3⌋ 2)))
#+end_src

Above, I have saved my personal input as an Org table.
Since the input is stored in rows, it will be imported as a list of
singleton lists, so we need to flatten it.
#+name: flatten
#+begin_src emacs-lisp
(defun flatten (list-of-list)
  (mapcar 'car list-of-list))
#+end_src

Once we've calculated the list of fuel requirements, we'll need to
sum them together; this is easily enough done by applying ~+~ to the list.
#+name: sum
#+begin_src emacs-lisp
(defun sum (l)
  (apply '+ l))
#+end_src

Now we just put the pieces together with a ~map~, or in ~elisp~ lingo,
a ~mapcar~.
#+begin_src emacs-lisp :var input=my-day1-input :noweb yes
<<naive-fuel-required>>
<<flatten>>
<<sum>>

(sum (mapcar 'fuel-required (flatten input)))
#+end_src

#+RESULTS:
: 3159380

*** The solution

For the most part, the solution remains the same;
the only difference is that ~fuel-required~ involves a recursive call
to calculate the fuel needed for the fuel.
#+name: real-fuel-required
#+begin_src emacs-lisp
(defun fuel-required (mass)
  (let ((⌊mass/3⌋ (truncate (/ mass 3))))
    (let ((required (- ⌊mass/3⌋ 2)))
      (if (> required 0)
        ; if required fuel is positive, add the amount required for that fuel
        (+ required (fuel-required required))
        ; else, if required fuel is zero or negative, just report 0
        '0))))
#+end_src

Combining with the remainder of the solution from above:
#+begin_src emacs-lisp :var input=my-input :noweb yes
<<real-fuel-required>>
<<flatten>>
<<sum>>

(sum (mapcar 'fuel-required (flatten input)))
#+end_src

#+RESULTS:
: 4736213

*** The code

#+name: int-code-comp
#+begin_src emacs-lisp
(defun int-code-comp (codes pos)
  (when (and (<= (+ pos 4) (length codes)))
    (let ((code         (nth pos codes))
          (operand1-pos (nth (+ pos 1) codes))
          (operand2-pos (nth (+ pos 2) codes))
          (result-pos   (nth (+ pos 3) codes)))
      ;; If the code is 99, immediately halt
      (when (/= code 99)
        ;; Otherwise, the code should be 1 or 2 (IMPROVE: check that)
        ;; 1 indicates +, 2 indicates *, and the operand and the
        ;; position to store the result we've already calculated.
        (let ((operator (cond ((= code 1) '+)
                              ((= code 2) '*)))
              (operand1   (nth operand1-pos codes))
              (operand2   (nth operand2-pos codes))
              (result-cdr (nthcdr result-pos codes)))
          (print operator)
          (setcar result-cdr (apply operator (list operand1 operand2))))
          (int-code-comp codes (+ pos 4)))))
  codes) ;; return the list
#+end_src

We do need to carefully read the instructions; on first pass,
(in addition to forgetting about opcode 99 indicating termination above)
I missed the instructions to replace the elements at positions 1 and 2 with
with 12 and 02 respectively.
#+begin_src emacs-lisp :var input=my-day2-input :noweb yes
<<int-code-comp>>

(let ((codes (mapcar 'string-to-number (split-string input ","))))
  (setcar (cdr codes)       12)
  (setcar (cdr (cdr codes)) 02)
  (let ((resulting-codes
          (int-code-comp codes 0)))
    ;; Get the head of the resulting codes
    (car resulting-codes)))
#+end_src

#+RESULTS:
: 3716250

